/*
 * DailyCost Localization
 * ----------------------
 * Russian
 *
 */

(function(app) {
	"use strict";

	app.addLanguage("ru", {

		preference: {
			"currency": "RUB".split("_"),
			"weekstart": 1
		},

		string: {
			"weekdays": "Воскресенье_Понедельник_Вторник_Среда_Четверг_Пятница_Суббота".split("_"),
			"weekdaysShort": "Вск_Пнд_Втр_Срд_Чтв_Птн_Сбт".split("_"),
			// "weekdaysMin": "Вс_Пн_Вт_Ср_Чт_Пт_Сб".split("_"),

			"pullText": "Новый ...|Новый р...|Новый ра...|Новый рас...|Новый расх...|Новый расхо...|Новый расход...|Новый расход!".split("|"),

			"formatMetaDate": '[<strong>]DD[</strong>].MM',
			"formatWeekScope1": '[<strong>]DD[</strong>]',
			"formatWeekScope2": '[<strong>]DD[</strong>].MM',
			"formatMonthScope": '[<strong>]MM[</strong>].YYYY',
			"formatYearScope": '[<strong>]YYYY[</strong>]',

			"settings": "Настройки",
			"preferences": "Установки",
			"categories": "Категории",
			"wallpaper": "Обои",
			"general": "Основные",
			"accountSettings": "Настройки уч. записи",
			"account": "Учетная запись",
			"sharing": "Поделиться",
			"currency": "Валюты",
			"security": "Безопасность",
			"feedback": "Обратная связь",
			"about": "О программе",
			"tipsAndTricks": "Советы и Подсказки",
			"preview": "Просмотр",
			"done": "Готово",
			"submit": "Принять",
			"restore": "Восстановить",
			"default": "По умолчанию",
			"weekstart": "Начало недели",

			"data": "Данные",
			"dataExportCSV": "Экспорт CSV по Email",
			"dataExportEmailSubject": "Резервная копия DailyCost",
			"dataExportEmailBody": "Keep it simple and elegant.",

			"date": "Дата",
			"sum": "Сумма",
			"category": "Категория",

			"entry": "Запись",
			"cost": "Расход",
			"earn": "Доход",
			"balance": "Баланс",

			"favoriteCurrencies": "Мои валюты",
			"allCurrencies": "Все валюты",

			"emptyCatlist": "Ой, здесь ничего еще нет!",

			"feedbackEmailSubject": "Оставить отзыв",

			"rollDays": "Дни",
			"rollTotal": "Расходы",
			"rollTotalSum": "Всего",

			"note": "Заметка",
			"createdOn": "Создана",

			"ratingsTitle": "Оцени DailyCost",
			"ratingsDescriptions": "Если Вам понравилась DailyCost, не могли бы Вы ее оценить? Это не займет больше минуты. Спасибо за Вашу поддержку!",
			"ratingsButtons": "Оценить,Позже"
		},

		category: {
			"default":        "Основные",
			"food":           "Еда",
			"food-breakfast": "Завтрак",
			"food-lunch":     "Обед",
			"food-dinner":    "Ужин",
			"drinks":         "Напитки",
			"groceries":      "Продукты",
			"shopping":       "Шоппинг",

			"personal":       "Личные",
			"entertain":      "Развлечения",
			"movies":         "Кино",
			"social":         "Социальные",
			"transport":      "Транспорт",

			"appstore":       "App Store",
			"mobile":         "Мобильный",
			"computer":       "Компютер",
			"gifts":          "Подарки",
			"housing":        "Домашние",

			"travel":         "Поездки",
			"tickets":        "Билеты",
			"books":          "Книги",
			"medical":        "Медицина",
			"transfer":       "Переводы"
		},

		currency: {
			"AED": "Дирхам ОАЭ",
			"AFN": "Афганская афганский",
			"ALL": "Aлбанский лек",
			"AMD": "Армянский драм",
			"ANG": "Нидерландский антильский гульден",
			"AOA": "Ангольская кванза",
			"ARS": "Аргентинский песо",
			"AUD": "Австралийский доллар",
			"AWG": "Арубанский флорин",
			"AZN": "Азербайджанский манат",

			"BAM": "Конвертируемая марка",
			"BBD": "Барбадосский доллар",
			"BDT": "Бангладешская така",
			"BGN": "Болгарский лев",
			"BHD": "Бахрейнский динар",
			"BIF": "Бурундийский франк",
			"BMD": "Бермудский доллар",
			"BND": "Брунейский доллар",
			"BOB": "Боливийский боливиано",
			"BRL": "Бразильский реал",
			"BSD": "Багамский доллар",
			"BTN": "Бутанский нгултрум",
			"BWP": "Ботсванская пула",
			"BYR": "Белорусский рубль",
			"BZD": "Белизский доллар",

			"CAD": "Канадский доллар",
			"CDF": "Конголезский франк",
			"CHF": "Швейцарский франк",
			"CLP": "Чилийский песо",
			"CNY": "Китайский юань",
			"COP": "Колумбийский песо",
			"CRC": "Коста-риканский колон",
			"CUC": "Кубинское конвертируемое песо",
			"CUP": "Кубинское песо",
			"CVE": "Кабо-Верде эскудо",
			"CZK": "Чешская крона",

			"DJF": "Джибутийский франк",
			"DKK": "Датская крона",
			"DOP": "Доминиканский песо",
			"DZD": "Алжирский динар",

			"EGP": "Египетский фунт",
			"ERN": "Эритрейская накфа",
			"ETB": "Эфиопский быр",
			"EUR": "Евро",

			"FJD": "Фиджи доллар",
			"FKP": "Фолклендских Островов фунт",

			"GBP": "Британский фунт",
			"GEL": "Грузинский лари",
			"GGP": "Гернсийский фунт",
			"GHS": "Ганский седи",
			"GIP": "Гибралтарский фунт",
			"GMD": "Гамбийский даласи",
			"GNF": "Гвинейский франк",
			"GTQ": "Гватемальский кетсаль",
			"GYD": "Гайанский доллар",

			"HKD": "Гонконгский доллар",
			"HNL": "Гондурасская лемпира",
			"HRK": "Хорватская куна",
			"HTG": "Гаитянский гурд",
			"HUF": "Венгерский форинт",

			"IDR": "Индонезийская рупия",
			"ILS": "Израильский шекель",
			"IMP": "Фунт острова мэн",
			"INR": "Индийская рупия",
			"IQD": "Иракский динар",
			"IRR": "Иранский риал",
			"ISK": "Исландская крона",

			"JEP": "Джерсийский фунт",
			"JMD": "Ямайский доллар",
			"JOD": "Иорданский динар",
			"JPY": "Японская йена",

			"KES": "Кенийский шиллинг",
			"KGS": "киргизских сомов",
			"KHR": "Камбоджийский риель",
			"KMF": "Коморский франк",
			"KPW": "Северокорейская вона",
			"KRW": "Южнокорейский вон",
			"KWD": "Кувейтский динар",
			"KYD": "Каимановых островов доллар",
			"KZT": "Казахский тенге",

			"LAK": "Лаосский кип",
			"LBP": "Ливанский фунт",
			"LKR": "Шри-Ланкийская рупия",
			"LRD": "Либерийский доллар",
			"LSL": "Лесото лоти",
			"LTL": "Литовский лит",
			"LVL": "Латвийский лат",
			"LYD": "Ливийский динар",

			"MAD": "Марокканский дирхам",
			"MDL": "Молдавский лей",
			"MGA": "Малагасийский ариари",
			"MKD": "Македонский денар",
			"MMK": "Мьянманский кьят",
			"MNT": "Монгольский тугрик",
			"MOP": "Макао патака",
			"MRO": "Мавританская угия",
			"MUR": "Маврикийская рупия",
			"MVR": "Мальдивская руфия",
			"MWK": "Малавийская квача",
			"MXN": "Мексиканский песо",
			"MYR": "Малайзийский ринггит",
			"MZN": "Мозамбикский метикал",

			"NAD": "Намибийский доллар",
			"NGN": "Нигерийская найра",
			"NIO": "Золотая кордоба",
			"NOK": "Норвежская крона",
			"NPR": "Непальская рупия",
			"NZD": "Новозеландский доллар",

			"OMR": "Оманский риал",

			"PAB": "Панамский бальбоа",
			"PEN": "Перуанский новый соль",
			"PGK": "Папуа-Новая Гвинея кина",
			"PHP": "Филиппинское песо",
			"PKR": "Пакистанская рупия",
			"PLN": "Польский злотый",
			"PYG": "Парагвайский гуарани",

			"QAR": "Катарский риал",

			"RON": "Новых румынских леев",
			"RSD": "Сербский динар",
			"RUB": "Российский рубль",
			"RWF": "Франк Руанды",

			"SAR": "Саудовский риал",
			"SBD": "Соломоновых островов доллар",
			"SCR": "Сейшельская рупия",
			"SDG": "Суданский фунт",
			"SEK": "Шведская крона",
			"SGD": "Сингапурский доллар",
			"SHP": "Святой Елены фунт",
			"SLL": "Сьерра-Леоне леоне",
			"SOS": "Сомалийский шиллинг",
			"SPL": "Seborgan Luigino", // Remark
			"SRD": "Суринамский доллар",
			"STD": "Сан-Томе и Принсипи добра",
			"SVC": "Сальвадорский колон",
			"SYP": "Сирийский фунт",
			"SZL": "Свазилендский лилангени",

			"THB": "Таиландский бат",
			"TJS": "Таджикский сомони",
			"TMT": "Туркменский манат",
			"TND": "Тунисский динар",
			"TOP": "Тонганская паанга",
			"TRY": "Турецкая лира",
			"TTD": "Тринидад и Тобаго доллар",
			"TVD": "Тувалу доллар",
			"TWD": "Тайваньский доллар",
			"TZS": "Танзанийский шиллинг",

			"UAH": "Украинская гривна",
			"UGX": "Угандийский шиллинг",
			"USD": "США доллар",
			"UYU": "Уругвайский песо",
			"UZS": "Узбекский сум",

			"VEF": "Боливар фуэрте",
			"VND": "Вьетнамский донг",
			"VUV": "Вануатский вату",

			"WST": "Самоанский тала",

			"XAF": "КФА BEAC франк",
			"XAG": "Серебро",
			"XAU": "Золото",
			"XCD": "Восточно-карибский доллар",
			"XDR": "СПЗ",
			"XOF": "КФА BCEAO франк",
			"XPD": "Палладий",
			"XPF": "КФП франк",
			"XPT": "Платина",

			"YER": "Йеменский риал",

			"ZAR": "Южноафриканский ранд",
			"ZMW": "Замбийская квача",
			"ZWD": "Зимбабвийский доллар"
		}

	});

}(DAILYCOST || {}));
